---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.Grid1Justification
source: html/1302cfec-7591-4e47-5ea3-8cc7ac9afb90.htm
---
# Autodesk.Revit.DB.CurtainGrid.Grid1Justification Property

The justification for the U grid line pattern of the curtain grid.

## Syntax (C#)
```csharp
public CurtainGridAlignType Grid1Justification { get; set; }
```